Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.LoadCaseForMinMaxEnum Enumeration
 Special load case numbers for min/max queries.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoadCaseForMinMaxEnum
Public Enumeration LoadCaseForMinMaxEnum
Members
Member name | Value | Description
LOADCASE_WITH_MIN_VALUE | -1 | The load case with the minimum signed value of the queried value type.
LOADCASE_WITH_MAX_VALUE | -2 | The load case with the maximum signed value of the queried value type.
LOADCASE_WITH_MAX_ABSOLUTE_VALUE | -3 | The load case with the maximum absolute value of the queried value type.
LOADCASE_WITH_MAX_FX_VALUE | -11 | The load case with the maximum axial (FX) value.
LOADCASE_WITH_MIN_FX_VALUE | -12 | The load case with the minimum axial (FX) value.
LOADCASE_WITH_MAX_FY_VALUE | -13 | The load case with the maximum shear Y (FY) value.
LOADCASE_WITH_MIN_FY_VALUE | -14 | The load case with the minimum shear Y (FY) value.
LOADCASE_WITH_MAX_FZ_VALUE | -15 | The load case with the maximum shear Z (FZ) value.
LOADCASE_WITH_MIN_FZ_VALUE | -16 | The load case with the minimum shear Z (FZ) value.
LOADCASE_WITH_MAX_MX_VALUE | -17 | The load case with the maximum torsional moment (MX) value.
LOADCASE_WITH_MIN_MX_VALUE | -18 | The load case with the minimum torsional moment (MX) value.
LOADCASE_WITH_MAX_MY_VALUE | -19 | The load case with the maximum bending moment Y (MY) value.
LOADCASE_WITH_MIN_MY_VALUE | -20 | The load case with the minimum bending moment Y (MY) value.
LOADCASE_WITH_MAX_MZ_VALUE | -21 | The load case with the maximum bending moment Z (MZ) value.
LOADCASE_WITH_MIN_MZ_VALUE | -22 | The load case with the minimum bending moment Z (MZ) value.
Examples
 Get the value from the load case with the maximum absolute value (whether positive or negative).
AnalysisResult.LoadCase = (int)AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MAX_ABSOLUTE_VALUE;
Examples
 Get the shear value from the load case with the minimum axial force value.
AnalysisResult.ValueType = AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Y;
AnalysisResult.LoadCase = (int)AnalysisResult.LoadCaseForMinMaxEnum.LOADCASE_WITH_MIN_FX_VALUE;
See Also
Reference
Tekla.Structures.Analysis Namespace